---
type: ImageType
namespace: Autodesk.Revit.DB
version: 2024
members: 18
tags: [revit-api, class]
---

# ImageType

`Autodesk.Revit.DB.ImageType` · Revit 2024 · 18 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CanReload | 2020 | `public bool CanReload ()` |
| Method | Create | 2020 | `public static ImageType Create ( Document document , ImageTypeOptions options )` |
| Method | GetImage | 2015 | `public Bitmap GetImage ()` |
| Method | Reload | 2015 | `public void Reload ()` |
| Method | ReloadFrom | 2020 | `public void ReloadFrom ( ImageTypeOptions options )` |
| Method | Unload | 2021 | `public void Unload ()` |
| Property | ExternalResourceType | 2020 | `public static ExternalResourceType ExternalResourceType { get ; }` |
| Property | Height | 2021 | `public double Height { get ; }` |
| Property | HeightInPixels | 2021 | `public int HeightInPixels { get ; }` |
| Property | PageNumber | 2020 | `public int PageNumber { get ; }` |
| Property | Parameter | — | `` |
| Property | Path | 2015 | `public string Path { get ; }` |
| Property | PathType | 2020 | `public PathType PathType { get ; }` |
| Property | Resolution | 2021 | `public double Resolution { get ; }` |
| Property | Source | 2021 | `public ImageTypeSource Source { get ; }` |
| Property | Status | 2021 | `public ImageTypeStatus Status { get ; }` |
| Property | Width | 2021 | `public double Width { get ; }` |
| Property | WidthInPixels | 2021 | `public int WidthInPixels { get ; }` |